import React from "react"
import Box from "@mui/material/Box"
import Typography from "@mui/material/Typography"

function Privacy() {
    return (
        <Box
            sx={{
                width: "100%",
                minHeight: "70dvh",
            }}
        >
            <Box
                sx={{
                    width: { xl: 1440, lg: 1368, xs: 360 },
                    margin: "0 auto",
                    py: "54px",
                    "& > p": {
                        ml: "24px",
                    },
                    "& > h4": {
                        mt: "24px",
                    },
                }}
            >
                <Typography variant="h3" gutterBottom>
                    Політика конфіденційності
                </Typography>

                <Typography variant="body1">
                    Компанія "Choice" (далі - "ми", "наша", "наші")
                    зобов'язується забезпечувати захист персональної інформації
                    Клієнтів і відвідувачів нашого веб-сайту. Ця політика
                    конфіденційності пояснює, як ми збираємо, використовуємо,
                    захищаємо і розкриваємо інформацію, яку ми отримуємо від
                    користувачів нашого веб-сайту.
                </Typography>

                <Typography variant="h4" gutterBottom>
                    1. Збір і використання інформації
                </Typography>

                <Typography variant="body1">
                    1.1. Ми збираємо особисту інформацію, таку як ім'я,
                    контактні дані, адреса електронної пошти та інша інформація,
                    яку ви нам надаєте добровільно під час використання нашого
                    веб-сайту або при спілкуванні з нами.
                </Typography>
                <Typography variant="body1">
                    1.2. Ми використовуємо зібрану інформацію для надання вам
                    послуг, вдосконалення якості наших послуг, відповіді на ваші
                    запити і сповіщення вас про наші новини та акції.
                </Typography>

                <Typography variant="h4" gutterBottom>
                    2. Захист інформації
                </Typography>

                <Typography variant="body1">
                    2.1. Ми приділяємо велику увагу захисту вашої особистої
                    інформації і застосовуємо необхідні технічні та
                    організаційні заходи для запобігання несанкціонованому
                    доступу, втрати, використанню або розкриттю цієї інформації.
                </Typography>
                <Typography variant="body1">
                    2.2. Ми зберігаємо ваші дані тільки протягом необхідного
                    часу для досягнення цілей, з яких вони були зібрані.
                </Typography>

                <Typography variant="h4" gutterBottom>
                    3. Розкриття інформації третім особам
                </Typography>

                <Typography variant="body1">
                    3.1. Ми можемо розкривати вашу особисту інформацію третім
                    особам лише в обсязі, необхідному для виконання наших послуг
                    або виконання законних вимог.
                </Typography>
                <Typography variant="body1">
                    3.2. Ми не продаємо, не обмінюємо та не передаємо вашу
                    особисту інформацію іншим сторонам з маркетинговими цілями
                    без вашого згоди.
                </Typography>

                <Typography variant="h4" gutterBottom>
                    4. Ваші права
                </Typography>

                <Typography variant="body1">
                    4.1. Ви маєте право звернутися до нас з проханням отримати
                    доступ до вашої особистої інформації, що зберігається у нас,
                    внести поправки в цю інформацію або вимагати її видалення.
                </Typography>

                <Typography variant="h4" gutterBottom>
                    5. Зміни до політики конфіденційності
                </Typography>

                <Typography variant="body1">
                    5.1. Ми можемо час від часу оновлювати цю політику
                    конфіденційності. Ми рекомендуємо періодично переглядати цю
                    сторінку для ознайомлення з будь-якими змінами. Зміни
                    набувають чинності з моменту їх публікації.
                </Typography>

                <Typography variant="h4" gutterBottom>
                    6. Контактні дані
                </Typography>

                <Typography variant="body1">
                    6.1. Для отримання додаткової інформації або уточнення
                    питань з приводу нашої політики конфіденційності ви можете
                    зв'язатися з нами за наступними контактними даними:{" "}
                    <a href="mailto:choice.shop.sup@gmail.com">
                        choice.shop.sup@gmail.com
                    </a>
                </Typography>
            </Box>
        </Box>
    )
}

export default Privacy
