import React from "react"
import Box from "@mui/material/Box"
import Typography from "@mui/material/Typography"

function PublicOffers() {
    return (
        <Box
            sx={{
                width: "100%",
                minHeight: "70dvh",
            }}
        >
            <Box
                sx={{
                    width: { xl: 1440, lg: 1368, xs: 360 },
                    margin: "0 auto",
                    py: "54px",
                    "& > p": {
                        ml: "24px",
                        mt: "12px",
                    },
                    "& > h4": {
                        mt: "24px",
                    },
                }}
            >
                <Typography variant="h3" gutterBottom>
                    ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА) на замовлення, купівлю-продаж і
                    доставку товарів
                </Typography>
                <Typography variant="body1" color="initial">
                    Цей договір є офіційною та публічною пропозицією Продавця
                    укласти договір купівлі-продажу Товару, представленого на
                    сайті choice.shop. Даний договір є публічним, тобто
                    відповідно до статті 633 Цивільного кодексу України, його
                    умови є однаковими для всіх покупців незалежно від їх
                    статусу (фізична особа, юридична особа, фізична
                    особа-підприємець) без надання переваги одному покупцю перед
                    іншим. Шляхом укладення цього Договору покупець в повному
                    обсязі приймає умови та порядок оформлення замовлення,
                    оплати товару, доставки товару, повернення товару,
                    відповідальності за недобросовісне замовлення та усі інші
                    умови договору. Договір вважається укладеним з моменту
                    натискання кнопки «Підтвердити Замовлення» на сторінці
                    оформлення замовлення в Розділі «Кошик» і отримання Покупцем
                    від Продавця підтвердження замовлення в електронному
                    вигляді.
                </Typography>
                <Typography variant="h4" color="initial">
                    1. Визначення термінів
                </Typography>
                <Typography variant="body1" color="initial">
                    1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція
                    Продавця, адресована невизначеному колу осіб, укласти з
                    Продавцем договір купівлі-продажу товару дистанційним
                    способом (далі - «Договір») на умовах, що містяться в цій
                    Оферті.
                </Typography>
                <Typography variant="body1" color="initial">
                    1.2. Товар або Послуга – об'єкт угоди сторін, який був
                    обраний покупцем на сайті Інтернет-магазину та поміщений у
                    кошик, або вже придбаний Покупцем у Продавця дистанційним
                    способом.
                </Typography>
                <Typography variant="body1" color="initial">
                    1.3. Інтернет-магазин – сайт Продавця за адресою
                    www.choice.shop створений для укладення договорів роздрібної
                    та оптової купівлі-продажу на підставі ознайомлення Покупця
                    із запропонованим Продавцем описом Товару за допомогою
                    мережі Інтернет.
                </Typography>
                <Typography variant="body1" color="initial">
                    1.4. Покупець – дієздатна фізична особа, яка досягла 18
                    років, отримує інформацію від Продавця, розміщує замовлення
                    щодо купівлі товару, що представлений на сайті
                    Інтернет-магазину для цілей, що не пов'язані зі здійсненням
                    підприємницької діяльності, або юридична особа чи фізична
                    особа-підприємець.
                </Typography>
                <Typography variant="body1" color="initial">
                    1.5. Продавець – Фізична особа підприємець «Лаєвський
                    Олександр Ігорович» (ідентифікаційний код 3262515953),
                    фізична особа, яка створена і діє відповідно до чинного
                    законодавства України, місцезнаходження якої: Україна, м.
                    Черкаси, вул. Коріатовичів князів узвіз, буд.11
                </Typography>
                <Typography variant="h4" color="initial">
                    2. Предмет Договору
                </Typography>
                <Typography variant="body1" color="initial">
                    2.1. Продавець зобов’язується передати у власність Покупцю
                    Товар, а Покупець зобов’язується оплатити і прийняти Товар
                    на умовах цього Договору. 2.2. Датою укладення
                    Договору-оферти (акцептом оферти) та моментом повного й
                    беззаперечного прийняттям Покупцем умов Договору вважається
                    дата заповнення Покупцем форми замовлення, розташованої на
                    сайті Інтернет-магазину, за умови отримання Покупцем від
                    Продавця підтвердження замовлення в електронному вигляді. У
                    разі необхідності, за бажанням Покупця, Договір може бути
                    оформлений у письмовій формі.
                </Typography>
                <Typography variant="h4" color="initial">
                    3. Оформлення Замовлення
                </Typography>
                <Typography variant="body1" color="initial">
                    3.1. Покупець самостійно оформлює замовлення в
                    Інтернет-магазину через форму «Кошика», або зробивши
                    замовлення електронною поштою чи за номером телефону,
                    вказаним в розділі контактів Інтернет-магазину.{" "}
                </Typography>{" "}
                <Typography variant="body1" color="initial">
                    3.2. Продавець має право відмовитися від передання
                    замовлення Покупцеві у випадку, якщо відомості, вказані
                    Покупцем під час оформлення замовлення, є неповними або
                    викликають підозру щодо їх дійсності.{" "}
                </Typography>{" "}
                <Typography variant="body1" color="initial">
                    3.3. При оформленні замовлення на сайті Інтернет-магазину
                    Покупець зобов'язується надати наступну обов’язкову
                    інформацію, необхідну Продавцю для виконання замовлення:
                </Typography>{" "}
                <Typography variant="body1" color="initial"></Typography>
                <Typography variant="body1" color="initial">
                    3.3.1. прізвище, ім'я Покупця;{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    3.3.2. адреса, за якою слід доставити Товар (якщо доставка
                    до адреси Покупця);
                </Typography>
                <Typography variant="body1" color="initial">
                    3.3.3. контактний телефон.
                </Typography>{" "}
                <Typography variant="body1" color="initial">
                    3.3.4. Ідентифікаційний код для юридичної особи або
                    фізичної-особи підприємця.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    3.4. Найменування, кількість, артикул, ціна обраного
                    Покупцем Товару вказуються в кошику Покупця на сайті
                    Інтернет-магазину.
                </Typography>
                <Typography variant="body1" color="initial">
                    3.5. Якщо будь-якої із Сторін договору необхідна додаткова
                    інформація, він має право запросити її у іншій Стороні. У
                    разі ненадання необхідної інформації Покупцем, Продавець не
                    несе відповідальності за надання якісної послуги Покупцю при
                    покупці товару в інтернет-магазині.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    3.6. При оформленні замовлення через оператора Продавця (п.
                    3.1. Цієї Оферти) Покупець зобов'язується надати інформацію,
                    зазначену в п. 3.3 – 3.4. цієї Оферти.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    3.7.Ухвалення Покупцем умов цієї Оферти здійснюється за
                    допомогою внесення Покупцем відповідних даних в реєстраційну
                    форму на сайті Інтернет-магазину або при оформленні
                    Замовлення через оператора. Після оформлення Замовлення
                    через Оператора дані про Покупця вносяться до бази даних
                    Продавця.
                </Typography>
                <Typography variant="body1" color="initial">
                    3.8. Покупець несе відповідальність за достовірність наданої
                    інформації при оформленні Замовлення.
                </Typography>
                <Typography variant="body1" color="initial">
                    3.9. Укладаючи Договір, тобто акцептуючи умови даної
                    пропозиції (запропоновані умови придбання Товару), шляхом
                    оформлення Замовлення, Покупець підтверджує наступне: а.
                    Покупець цілком і повністю ознайомлений, і згоден з умовами
                    цієї пропозиції (оферти); б. він дає дозвіл на збір, обробку
                    та передачу персональних даних, дозвіл на обробку
                    персональних даних діє протягом усього терміну дії Договору,
                    а також протягом необмеженого терміну після закінчення його
                    дії. Крім цього, укладенням договору Покупець підтверджує,
                    що він повідомлений (без додаткового повідомлення) про
                    права, встановлених Законом України "Про захист персональних
                    даних", про цілі збору даних, а також про те, що його
                    персональні дані передаються Продавцю з метою можливості
                    виконання умов цього Договору, можливості проведення
                    взаєморозрахунків, а також для отримання рахунків, актів та
                    інших документів. Покупець також погоджується з тим, що
                    Продавець має право надавати доступ та передавати його
                    персональні дані третім особам без будь-яких додаткових
                    повідомлень Покупця з метою виконання замовлення Покупця.
                    Обсяг прав Покупця, як суб'єкта персональних даних
                    відповідно до Закону України "Про захист персональних даних"
                    йому відомий і зрозумілий.
                </Typography>
                <Typography variant="h4" color="initial">
                    4. Ціна і Доставка Товару
                </Typography>
                <Typography variant="body1" color="initial">
                    4.1 Ціни на Товари та послуги визначаються Продавцем
                    самостійно та вказані на сайті Інтернет-магазину. Всі ціни
                    на Товари та послуги вказані на сайті у гривнях з
                    урахуванням ПДВ.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    4.2 Ціни на Товари та послуги можуть змінюватися Продавцем в
                    односторонньому порядку залежно від кон'юнктури ринку. При
                    цьому ціна окремої одиниці Товару, вартість якої оплачена
                    Покупцем в повному обсязі, не може бути змінена Продавцем в
                    односторонньому порядку.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    4.3.Вартість Товару, яка вказана на сайті Інтернет-магазину
                    не включає в себе вартість доставки Товару Покупцю. Вартість
                    доставки Товару Покупець сплачує відповідно до діючих
                    тарифів служб доставки (перевізників) безпосередньо обраній
                    ним службі доставки (перевізнику).{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    4.4. Вартість Товару яка вказана на сайті Інтернет-магазину
                    не включає в себе вартість доставки Товару на адресу
                    Покупця.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    4.5. Продавець може вказати орієнтовну вартість доставки
                    Товару на адресу Покупця під час звернення Покупця із
                    відповідним запитом до Продавця шляхом надіслання листа на
                    електронну пошту або при оформленні замовлення через
                    оператора інтернет-магазину.
                </Typography>
                <Typography variant="body1" color="initial">
                    4.6. Зобов'язання Покупця по оплаті Товару вважаються
                    виконаними з моменту надходження Продавцю коштів на його
                    рахунок.
                </Typography>
                <Typography variant="body1" color="initial">
                    4.7. Розрахунки між Продавцем і Покупцем за Товар
                    здійснюються способами, зазначеними на сайті
                    Інтернет-магазину в розділі «Оплата і Доставка».
                </Typography>
                <Typography variant="body1" color="initial">
                    4.8. При отриманні товару Покупець повинен у присутності
                    представника служби доставки (перевізника) перевірити
                    відповідність Товару якісним і кількісним характеристикам
                    (найменування товару, кількість, комплектність, термін
                    придатності).{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    4.9. Покупець або його представник під час приймання Товару
                    підтверджує своїм підписом в товарному чеку/ або в
                    замовленні/ або в транспортній накладній на доставку
                    товарів, що не має претензій до кількості товару, зовнішнім
                    виглядом і комплектності товару.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    4.10. Право власності та ризик випадкової втрати або
                    пошкодження Товару переходить до Покупця або його
                    Представника з моменту отримання Товару Покупцем в місті
                    поставки Товару при самостійній доставки Товару від
                    Продавця, чи під час передачі Продавцем товару службі
                    доставки (перевізнику) обраної Покупцем.
                </Typography>
                <Typography variant="h4" color="initial">
                    5. Права ті обов’язки Сторін
                </Typography>
                <Typography variant="body1" color="initial">
                    5.1. Продавець зобов’язаний:{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    {" "}
                    5.1.1. Передати Покупцеві товар у відповідності до умов
                    цього Договору та замовлення Покупця.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    5.1.2. Не розголошувати будь-яку приватну інформацію про
                    Покупця і не надавати доступ до цієї інформації третім
                    особам, за винятком випадків, передбачених законодавством та
                    під час виконання Замовлення Покупця.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    {" "}
                    5.2. Продавець має право:{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    5.2.1 Змінювати умови цього Договору, а також ціни на Товари
                    та послуги, в односторонньому порядку, розміщуючи їх на
                    сайті Інтернет-магазину. Всі зміни набувають чинності з
                    моменту їх публікації.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    5.3 Покупець зобов'язується:{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    5.3.1 До моменту укладення Договору ознайомитися зі змістом
                    Договору, умовами Договору і цінами, запропонованими
                    Продавцем на сайті Інтернет-магазину.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    5.3.2 На виконання Продавцем своїх зобов'язань перед
                    Покупцем останній повинен повідомити всі необхідні дані, що
                    однозначно ідентифікують його як Покупця, і достатні для
                    доставки Покупцеві замовленого Товару.
                </Typography>
                <Typography variant="h4" color="initial">
                    6. Повернення Товару
                </Typography>
                <Typography variant="body1" color="initial">
                    6.1. Продавець не надає гарантії та повернення на продані
                    товари на підставі Закону України «Про захист прав
                    споживачів».{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    6.2. Придбаний товар Покупцем має перевірятися виключно при
                    отримані у місця отримання товару.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    6.3. Допускаються окремі випадки повернення та обміну при
                    погодженні сторін.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    6.4. Повернення товару, у випадках, передбачених пунктом{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    6.5 за цим Договором, здійснюється за адресою, вказаною на
                    сайті в розділі «Контакти»
                </Typography>
                <Typography variant="h4" color="initial">
                    7. Відповідальність
                </Typography>
                <Typography variant="body1" color="initial">
                    7.1. Продавець не несе відповідальності за шкоду, заподіяну
                    Покупцеві або третім особам внаслідок неналежного монтажу,
                    використання, зберігання Товару придбаного у Продавця.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    7.2. Продавець не несе відповідальності за неналежне,
                    несвоєчасне виконання Замовлень і своїх зобов’язань у
                    випадку надання Покупцем недостовірної або помилкової
                    інформації.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    {" "}
                    7.3. Продавець і Покупець несуть відповідальність за
                    виконання своїх зобов'язань відповідно до чинного
                    законодавства України і положень цього Договору.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    7.4. Продавець або Покупець звільняються від
                    відповідальності за повне або часткове невиконання своїх
                    зобов'язань, якщо невиконання є наслідком форс-мажорних
                    обставин як: війна або військові дії, землетрус, повінь,
                    пожежа та інші стихійні лиха, що виникли незалежно від волі
                    Продавця і / або Покупця після укладення цього договору.
                    Сторона, яка не може виконати свої зобов'язання, негайно
                    повідомляє про це іншу Сторону.
                </Typography>
                <Typography variant="h4" color="initial">
                    8. Конфіденційність і захист персональних даних.
                </Typography>
                <Typography variant="body1" color="initial">
                    8.1. Надаючи свої персональні дані на сайті
                    Інтернет-магазину при реєстрації або оформленні Замовлення,
                    Покупець надає Продавцеві свою добровільну згоду на обробку,
                    використання (у тому числі і передачу) своїх персональних
                    даних, а також вчинення інших дій, передбачених Законом
                    України «Про захист персональних даних», без обмеження
                    терміну дії такої згоди.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    8.2. Продавець зобов'язується не розголошувати отриману від
                    Покупця інформацію. Не вважається порушенням надання
                    Продавцем інформації контрагентам і третім особам, що діють
                    на підставі договору з Продавцем, в тому числі і для
                    виконання зобов'язань перед Покупцем, а також у випадках,
                    коли розкриття такої інформації встановлено вимогами чинного
                    законодавства України.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    8.3. Покупець несе відповідальність за підтримання своїх
                    персональних даних в актуальному стані. Продавець не несе
                    відповідальності за неякісне виконання або невиконання своїх
                    зобов'язань у зв'язку з неактуальністю інформації про
                    Покупця або невідповідністю її дійсності.
                </Typography>
                <Typography variant="h4" color="initial">
                    9. Інші умови
                </Typography>
                <Typography variant="body1" color="initial">
                    9.1. Цей договір укладено на території України і діє
                    відповідно до чинного законодавства України.{" "}
                </Typography>
                <Typography variant="body1" color="initial">
                    9.2. Усі спори, що виникають між Покупцем і Продавцем,
                    вирішуються шляхом переговорів. У випадку недосягнення
                    врегулювання спірного питання шляхом переговорів, Покупець
                    та/або Продавець мають право звернутися за вирішенням спору
                    до судових органів відповідно до чинного законодавства
                    України.
                </Typography>
                <Typography variant="body1" color="initial">
                    9.3. Продавець має право вносити зміни до цього Договору в
                    односторонньому порядку, передбаченому п. 5.2.1. Договору.
                    Крім того, зміни до Договору також можуть бути внесені за
                    взаємною згодою Сторін в порядку, передбаченому чинним
                    законодавством України.
                </Typography>
                <Typography variant="h4" color="initial">
                    АДРЕСА ТА РЕКВІЗИТИ ПРОДАВЦЯ:
                </Typography>
                <Typography variant="h4" color="initial">
                    ФОП «Лаєвський О.І»
                </Typography>
                <Typography variant="h6" color="initial">
                    Україна, м. Черкаси вул. Коріатовичів князів узвіз, буд. 11
                    п/р UA333052990000026003041609404 в АТ КБ «ПриватБанк» МФО
                    305299 Код 3262515953
                </Typography>
                <Typography variant="h6">
                    Для уточнення деталей договору Клієнт може звертатися до
                    компанії "Choice" за наступними контактними даними:{" "}
                    <a href="mailto:choice.shop.sup@gmail.com">
                        choice.shop.sup@gmail.com
                    </a>
                </Typography>
            </Box>
        </Box>
    )
}

export default PublicOffers
